<?php

/*
|--------------------------------------------------------------------------
| Lara Updater Language Lines
|--------------------------------------------------------------------------
*/

return [
    'SYSTEM_VERSION'        => 'إصدار النظام: ',
    'PERMISSION_DENIED'     => 'المستخدم غير مصرح له بإجراء التحديثات.',
    'ALREADY_UPDATED'       => 'النظام محدث بالفعل إلى آخر إصدار.',
    'BACKUP'                => 'تم إنشاء مجلد النسخة الاحتياطية.',
    'BACKUP_FOUND'          => 'تم العثور على نسخة احتياطية: ',
    'DOWNLOADING'           => 'جاري تحميل التحديث...',
    'DOWNLOADING_SUCCESS'   => 'تم تحميل التحديث بنجاح.',
    'DOWNLOADING_ERROR'     => 'حدث خطأ أثناء التحميل.',
    'MAINTENANCE_MODE_ON'   => 'وضع الصيانة: مفعّل',
    'MAINTENANCE_MODE_OFF'  => 'وضع الصيانة: معطّل',
    'INSTALLATION_SUCCESS'  => 'تم تثبيت التحديث بنجاح.',
    'INSTALLATION_ERROR'    => 'حدث خطأ أثناء التثبيت.',
    'RECOVERY'              => 'يحاول النظام استعادة نسختك من النسخة الاحتياطية.',
    'RECOVERY_SUCCESS'      => 'تمت الاستعادة بنجاح.',
    'RECOVERY_ERROR'        => 'فشلت الاستعادة، حاول يدوياً. تذكر: \'php artisan up\' لتعطيل وضع الصيانة.',
    'EXCEPTION'             => 'حدث استثناء: ',
    'CHANGELOG'             => 'سجل التغييرات:',
    'DIRECTORY_CREATED'     => 'تم إنشاء المجلد: ',
    'FILE_EXIST'            => 'الملف موجود: ',
    'FILE_COPIED'           => 'تم نسخ الملف: ',
    'EXECUTE_UPDATE_SCRIPT' => 'تنفيذ السكريبت المضمن في التحديث.',
    'TEMP_CLEANED'          => 'تم حذف الملفات المؤقتة.',
];
